{
  "_class_name": "PartCrafterPipeline",
  "_diffusers_version": "0.34.0",
  "feature_extractor_dinov2": [
    "transformers",
    "BitImageProcessor"
  ],
  "image_encoder_dinov2": [
    "transformers",
    "Dinov2Model"
  ],
  "scheduler": [
    "triposg.schedulers.scheduling_rectified_flow",
    "RectifiedFlowScheduler"
  ],
  "transformer": [
    "partcrafter.models.transformers.partcrafter_transformer",
    "PartCrafterDiTModel"
  ],
  "vae": [
    "triposg.models.autoencoders.autoencoder_kl_triposg",
    "TripoSGVAEModel"
  ]
}